{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 1,
      "content": {
        "json": "# Secret Key ID by SPN/EA\r\n\r\nThis workbook is providing the amount of time each secret ID is in use."
      },
      "name": "text - 2"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "crossComponentResources": [
          "{Subscription}"
        ],
        "parameters": [
          {
            "id": "f6739d97-a2cc-455c-b23b-803084d7175e",
            "version": "KqlParameterItem/1.0",
            "name": "Subscription",
            "type": 6,
            "isRequired": true,
            "isGlobal": true,
            "typeSettings": {
              "additionalResourceOptions": [],
              "includeAll": true,
              "showDefault": false
            },
            "value": null
          },
          {
            "id": "75c4be23-e583-42d1-8c6b-842512eb0963",
            "version": "KqlParameterItem/1.0",
            "name": "laws",
            "label": "Log Analytics Workspace",
            "type": 5,
            "isRequired": true,
            "isGlobal": true,
            "query": "resources\r\n| where type == \"microsoft.operationalinsights/workspaces\"\r\n| project value = id, label = name, selected = false, group = resourceGroup",
            "crossComponentResources": [
              "{Subscription}"
            ],
            "typeSettings": {
              "resourceTypeFilter": {
                "microsoft.operationalinsights/workspaces": true
              },
              "additionalResourceOptions": [],
              "showDefault": false
            },
            "timeContext": {
              "durationMs": 86400000
            },
            "queryType": 1,
            "resourceType": "microsoft.operationalinsights/workspaces"
          },
          {
            "id": "41698c46-3216-4532-a703-e79fa2e5b88a",
            "version": "KqlParameterItem/1.0",
            "name": "LookupTime",
            "label": "Lookup Time",
            "type": 4,
            "isRequired": true,
            "isGlobal": true,
            "typeSettings": {
              "selectableValues": [
                {
                  "durationMs": 86400000
                },
                {
                  "durationMs": 172800000
                },
                {
                  "durationMs": 604800000
                },
                {
                  "durationMs": 1209600000
                },
                {
                  "durationMs": 2592000000
                },
                {
                  "durationMs": 5184000000
                },
                {
                  "durationMs": 7776000000
                }
              ]
            },
            "timeContext": {
              "durationMs": 86400000
            },
            "value": {
              "durationMs": 86400000
            }
          },
          {
            "id": "24c5b260-95c0-4aeb-a0bc-ea95fc1576c2",
            "version": "KqlParameterItem/1.0",
            "name": "ServicePrincipalName",
            "type": 2,
            "description": "Select AppID",
            "isRequired": true,
            "isGlobal": true,
            "query": "AADServicePrincipalSignInLogs\r\n| summarize by ServicePrincipalName",
            "crossComponentResources": [
              "{laws}"
            ],
            "typeSettings": {
              "additionalResourceOptions": [],
              "showDefault": false
            },
            "timeContext": {
              "durationMs": 0
            },
            "timeContextFromParameter": "LookupTime",
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces",
            "value": null
          }
        ],
        "style": "pills",
        "queryType": 1,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "parameters - 1"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AADServicePrincipalSignInLogs\r\n| where ServicePrincipalName == \"{ServicePrincipalName}\"\r\n| summarize count() by ServicePrincipalCredentialKeyId\r\n| render piechart ",
        "size": 0,
        "title": "KeyID used",
        "timeContextFromParameter": "LookupTime",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{laws}"
        ]
      },
      "customWidth": "50",
      "name": "query - 0"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AADServicePrincipalSignInLogs\r\n| where ServicePrincipalName == \"{ServicePrincipalName}\"\r\n| summarize count() by ServicePrincipalCredentialKeyId ",
        "size": 0,
        "title": "KeyID used",
        "timeContextFromParameter": "LookupTime",
        "exportFieldName": "ServicePrincipalCredentialKeyId",
        "exportParameterName": "secretid",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{laws}"
        ],
        "visualization": "table"
      },
      "customWidth": "50",
      "name": "query - 0 - Copy"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AADServicePrincipalSignInLogs\r\n| where ServicePrincipalCredentialKeyId == \"{secretid}\"",
        "size": 0,
        "timeContext": {
          "durationMs": 86400000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{laws}"
        ]
      },
      "conditionalVisibility": {
        "parameterName": "secretid",
        "comparison": "isNotEqualTo",
        "value": ""
      },
      "customWidth": "50",
      "name": "query - 4"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AADServicePrincipalSignInLogs\r\n| where ServicePrincipalCredentialKeyId == \"{secretid}\"\r\n| extend LocationDetails = todynamic(LocationDetails)\r\n| extend latitude = LocationDetails.geoCoordinates.latitude\r\n| extend longitude = LocationDetails.geoCoordinates.longitude\r\n| extend state = LocationDetails.state\r\n| summarize count() by tostring(state), tostring(latitude), tostring(longitude)",
        "size": 0,
        "timeContext": {
          "durationMs": 86400000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{laws}"
        ],
        "visualization": "map",
        "mapSettings": {
          "locInfo": "LatLong",
          "locInfoColumn": "LocationDetails",
          "latitude": "latitude",
          "longitude": "longitude",
          "sizeSettings": "count_",
          "sizeAggregation": "Sum",
          "minSize": 10,
          "maxSize": 30,
          "defaultSize": 10,
          "labelSettings": "state",
          "legendMetric": "count_",
          "legendAggregation": "Sum",
          "itemColorSettings": null
        }
      },
      "conditionalVisibility": {
        "parameterName": "secretid",
        "comparison": "isNotEqualTo",
        "value": ""
      },
      "customWidth": "50",
      "name": "query - 4 - Copy"
    }
  ],
  "fallbackResourceIds": [
    "Azure Monitor"
  ],
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}